#title: README.org
#+property: header-args :mkdirp yes :results verbatim

** verify pc1

#+caption: 检查pc1 的nic配置
#+begin_src bash
docker exec clab-frrlab-PC1 ip a
docker exec clab-frrlab-PC1 ip route
#+end_src

#+RESULTS:
#+begin_example
1: lo: <LOOPBACK,UP,LOWER_UP> mtu 65536 qdisc noqueue state UNKNOWN group default qlen 1000
    link/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00
    inet 127.0.0.1/8 scope host lo
       valid_lft forever preferred_lft forever
    inet6 ::1/128 scope host
       valid_lft forever preferred_lft forever
234: eth0@if235: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc noqueue state UP group default
    link/ether 02:42:ac:14:14:06 brd ff:ff:ff:ff:ff:ff link-netnsid 0
    inet 172.20.20.6/24 brd 172.20.20.255 scope global eth0
       valid_lft forever preferred_lft forever
    inet6 2001:172:20:20::6/64 scope global nodad
       valid_lft forever preferred_lft forever
    inet6 fe80::42:acff:fe14:1406/64 scope link
       valid_lft forever preferred_lft forever
243: eth1@if242: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc noqueue state UP group default
    link/ether aa:c1:ab:86:de:b7 brd ff:ff:ff:ff:ff:ff link-netnsid 1
    inet 192.168.11.2/24 scope global eth1
       valid_lft forever preferred_lft forever
    inet6 fe80::a8c1:abff:fe86:deb7/64 scope link
       valid_lft forever preferred_lft forever
default via 172.20.20.1 dev eth0
10.10.10.0/24 via 192.168.11.1 dev eth1
172.20.20.0/24 dev eth0 proto kernel scope link src 172.20.20.6
192.168.0.0/16 via 192.168.11.1 dev eth1
192.168.11.0/24 dev eth1 proto kernel scope link src 192.168.11.2
#+end_example

#+caption: ping all router and pc
#+begin_src bash
echo "ping router1"
docker exec clab-frrlab-PC1 ping -c1 192.168.11.1
echo "ping router2"
docker exec clab-frrlab-PC1 ping -c1 192.168.12.1
echo "ping router3"
docker exec clab-frrlab-PC1 ping -c1 192.168.13.1
echo "ping PC2"
docker exec clab-frrlab-PC1 ping -c1 192.168.12.2
echo "ping PC3"
docker exec clab-frrlab-PC1 ping -c1 192.168.13.2
#+end_src

#+caption: ping all router's interchange ip
#+begin_src bash
docker exec clab-frrlab-PC1 ping -c1 192.168.1.1
docker exec clab-frrlab-PC1 ping -c1 192.168.1.2
docker exec clab-frrlab-PC1 ping -c1 192.168.2.1
docker exec clab-frrlab-PC1 ping -c1 192.168.2.2
docker exec clab-frrlab-PC1 ping -c1 192.168.3.1
docker exec clab-frrlab-PC1 ping -c1 192.168.3.2

#+end_src

** show duwn eth2@router1
#+begin_src bash
docker exec clab-frrlab-PC1 traceroute 192.168.13.2
#+end_src

#+RESULTS:
: traceroute to 192.168.13.2 (192.168.13.2), 30 hops max, 46 byte packets
:  1  192.168.11.1 (192.168.11.1)  0.003 ms  0.003 ms  0.003 ms
:  2  192.168.1.2 (192.168.1.2)  0.002 ms  0.003 ms  0.003 ms
:  3  192.168.3.2 (192.168.3.2)  0.003 ms  0.003 ms  0.003 ms
:  4  192.168.13.2 (192.168.13.2)  0.003 ms  0.003 ms  0.002 ms

#+begin_src bash
sudo ip netns exec clab-frrlab-router1 ip link set dev eth2 down
#+end_src

#+RESULTS:


#+begin_src bash
docker exec clab-frrlab-PC1 traceroute 192.168.13.2
#+end_src

#+RESULTS:
: traceroute to 192.168.13.2 (192.168.13.2), 30 hops max, 46 byte packets
:  1  192.168.11.1 (192.168.11.1)  0.007 ms  0.005 ms  0.004 ms
:  2  192.168.2.2 (192.168.2.2)  0.003 ms  0.005 ms  0.004 ms
:  3  192.168.13.2 (192.168.13.2)  0.004 ms  0.007 ms  0.005 ms

#+begin_src bash
sudo ip netns exec clab-frrlab-router1 ip link set dev eth2 up

#+end_src

#+RESULTS:

